<HTML>
<HEAD>
<TITLE>Phylo</TITLE>
</HEAD>	
<BODY><TABLE ><tr><td>
<FONT face="verdana" size=3 color="#F83823">Introduction</font>
<Font face="verdana" size=2 color="#898989">
<p>Nous appelons ce jeu <B>Phylo -- Un outil de calcul humain pour g&eacute;nomique comparative</B>, mais ne te laisse pas impressionner par le nom, c'est juste un jeu interactif qui te permettra de participer &agrave; l'avanc&eacute;e scientifique.<BR>Tous ce dont tu as besoin est d'un peu de temps et d'un bon coup d'oeil!
<P>Si tu n'es pas sp&eacute;cialement int&eacute;ress&eacute; par les motivations scientifiques de ce jeu clique 'Play' et jouer de suite. Sinon tu peux trouver toutes les informations n&eacute;cessaires pour comprendre les motivations de ce projet sur la page 'About'.
<p><FONT face="verdana" size=3 color="#F83823">Phylo en bref</font>
<P><Font face="verdana" size=2 color="#898989">
<B><U>Le Probl&egrave;me:</U></B>:
<P>&nbsp;&nbsp;&nbsp;&nbsp;Les s&eacute;quences g&eacute;n&eacute;tiques sont difficiles &agrave; comprendre. Pour d&eacute;chiffrer leur structure, nous avons besoin de les comparer afin de d&eacute;tecter les r&eacute;gions qui pr&eacute;sentent des similarit&eacute;s. Ces r&eacute;gions similaires peuvent indiquer des &eacute;l&eacute;ments important de notre code g&eacute;n&eacute;tique. Nous avons plusieurs g&eacute;nomes &agrave; aligner et nous appelons cela le probl&egrave;me d'alignement de s&eacute;quences multiples.
<P><B><U>Le Jeu:</U></B>:
<P>&nbsp;&nbsp;&nbsp;&nbsp;Nous abstrayons le probl&egrave;me d'alignement de s&eacute;quences multiples &agrave; un jeu o&ugrave; le but est d'aligner des mots faits de pi&egrave;ces de diff&eacute;rentes couleurs repr&eacute;sentant le code g&eacute;n&eacute;tique (A,C,G,T). Les s&eacute;quences sont affich&eacute;es sur une grille sur laquelle vous pouvez faire glisser les pi&egrave;ces horizontalement. Votre but sera de cr&eacute;er des colonnes de couleur identique. Cependant, ce ne sera pas toujours possible. Parfois il vous faudra  disposer des pi&egrave;ces de couleur diff&eacute;rentes dans ces colonnes et vous serez l&eacute;g&egrave;rement p&eacute;nalis&eacute;. Parfois vous allez aussi avoir besoin de cr&eacute;er des espaces (i.e. les places inoccup&eacute;es de voter grille). Ces espaces sont in&eacute;vitables et fortement p&eacute;nalis&eacute;s. Votre but sera de trouver le meilleur compromis entre l'alignement de couleurs et la cr&eacute;ation d'espaces.<BR>Le jeu fonctionne comme suit: Au d&eacute;but vous commencez avec deux s&eacute;quences. Vous allez essayer de trouver le meilleur alignement et battre le score obtenu par l'ordinateur. Quand vous r&eacute;ussirez l'&eacute;toile en bas &agrave; droite s'illuminera et il ne vous restera plus qu'&agrave; cliquer dessus pour passer au niveau suivant. Une nouvelle s&eacute;quence est alors ajout&eacute;e et vous allez maintenant aligner  trois s&eacute;quences. Le processus va se r&eacute;p&eacute;ter jusqu'&agrave; ce que toutes les s&eacute;quences soient align&eacute;es.
<!--<P><B><U>Remarques:</U></B>:
<UL><LI>Vous pouvez choisir un puzzle associ&eacute; &agrave; une maladie que vous souhaiter traiter.<LI>Une section recensant les plus grands contributeurs est accessible en haut &agrave; droite de la fen&ecirc;tre de jeu.</UL> -->
<P>Amuse toi bien!
<HR style="height: 2px" color="#696969"/>
</font>
</tr></td></table>
	</BODY>
</HTML>

